Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_Framework_Swift/Framework_Swift-level2_source2.tmx
Source language: en_us
Languages: ja

source: Use the isStrictSubset(of:) and isStrictSuperset(of:) methods to test whether a set is a subset or superset of, but not equal to, another set.
ja: isStrictSubset(of:)およびisStrictSuperset(of:)メソッドを使って、ある集合が別の集合の下位集合または上位集合である、しかし等しくはないものであるかどうかテストしてください。

source: Use the isSubset(of:) method to test whether a set contains all the elements of another set or sequence.
ja: isSubset(of:)メソッドを使って、ある集合が別の集合またはシーケンスに属する要素すべてを含むかどうかテストしてください。

source: Use the isSuperset(of:) method to test whether all elements of a set are contained in another set or sequence.
ja: isSuperset(of:)メソッドを使って、ある集合のすべての要素が別の集合またはシーケンスの中に含まれるかどうかテストしてください。

source: Use the map method with a closure that returns a non-optional value.
ja: このmapメソッドを、非オプショナル値を返すクロージャとともに使ってください。

source: Use the reduce(_:_:) method to produce a single value from the elements of an entire sequence.
ja: reduce(_:_:)メソッドを使って、あるシーケンス全体の要素それらからある単一の値を生成してください。

source: Use the reduce(into:_:) method to produce a single value from the elements of an entire sequence.
ja: reduce(into:_:)メソッドを使って、あるシーケンス全体の要素それらからある単一の値を生成してください。

source: Use the shuffle() method to randomly reorder the elements of an array.
ja: shuffle()メソッドを使って、配列の要素を無作為に再配列してください。

source: Use the subtracting(_:) method to create a new set with the elements of a set that are not also in another set or sequence.
ja: subtracting(_:)メソッドを使って、別の集合またはシーケンスにはないある集合の要素で新しい集合を作成してください。

source: Use the symmetricDifference(_:) method to create a new set with the elements that are in either a set or another set or sequence, but not in both.
ja: symmetricDifference(_:)メソッドを使って、ある集合または別の集合かシーケンスのどちらかにある、しかし両方にではない要素で新しい集合を作成してください。

source: Use the union(_:) method to create a new set with the elements of a set and another set or sequence.
ja: union(_:)メソッドを使って、ある集合と別の集合またはシーケンスに属する要素で新しい集合を作成してください。

source: Use the Result type in these scenarios to capture the result of a potentially failing operation.
ja: Result型をそれらの状況において使用して、失敗する可能性のある演算の結果をキャプチャしてください。

source: Use the formatted() method to apply the default list format style to a sequence of strings.
ja: formatted()メソッドを使って、省略時のリスト書式形式を文字列いくつからなるあるシーケンスに適用してください。

source: Use the formatted(_:) method to apply a custom list format style.
ja: formatted(_:)メソッドを使ってあつらえのリスト書式形式を適用しください。

source: Use the closed range operator (...) to create a closed range of any type that conforms to the Comparable protocol.
ja: 完結範囲演算子（...）を使ってComparableプロトコルに準拠する何らかの型の配列を作成します。

source: Use the half-open range operator (..<) to create a range of any type that conforms to the Comparable protocol.
ja: 半開範囲演算子（..<）を使ってComparableプロトコルに準拠する何らかの型の配列を作成します。

source: Use the masking left shift operator (&<<) when you need to perform a shift and are sure that the shift amount is in the range 0...bitWidth.
ja: マスク左シフト演算子（&<<）を、あなたがあるシフトを実行する、そしてシフト量が範囲0...bitWidthの中であるのを確実にする必要がある場合に使ってください。

source: Use the masking right shift operator (&>>) when you need to perform a shift and are sure that the shift amount is in the range 0...bitWidth.
ja: マスク右シフト演算子（&>>）を、あなたがあるシフトを実行する、そしてシフト量が範囲0...bitWidthの中であるのを確実にする必要がある場合に使ってください。

source: Use the nil-coalescing operator (??) to supply a default value in case the Optional instance is nil.
ja: nil合体演算子（??）を使って、省略時の値をOptionalインスタンスがnilの場合に提供してください。

source: Use the postfix range operator (postfix ...) to create a partial range of any type that conforms to the Comparable protocol.
ja: 後置完結範囲演算子（後置...）を使うことで何らかの型の部分的な範囲でComparableプロトコルに準拠するものを作成してください。

source: Use the prefix closed range operator (prefix ...) to create a partial range of any type that conforms to the Comparable protocol.
ja: 前置完結範囲演算子（前置...）を使うことで何らかの型の部分的な範囲でComparableプロトコルに準拠するものを作成してください。

source: Use the prefix half-open range operator (prefix ..<) to create a partial range of any type that conforms to the Comparable protocol.
ja: 前置半開範囲演算子（前置..<）を使うことで何らかの型の部分的な範囲でComparableプロトコルに準拠するものを作成してください。

source: Use the “equal to” operator (==) to test whether two sets contain the same elements.
ja: 「同等」演算子（==）を使って、２つの集合が同じ要素らを含むかどうかテストしてください。

source: Use these static properties to access a type's layout.
ja: これらの静的プロパティを使ってある型の持つレイアウトにアクセスしてください。

source: Use this equal-to operator (==) to compare any two optional instances of a type that conforms to the Equatable protocol.
ja: この同等演算子（==）を使って、Equatableプロトコルに準拠するある型の何らかの２つのオプショナルインスタンスを比較してください。

source: Use this initializer to avoid intermediate reallocations of a set’s storage buffer when you know how many elements you’ll insert into the set after creation.
ja: あなたがどのくらい多くの要素を作成後の集合に挿入するか知っているならば、このイニシャライザを使って集合の持つストレージバッファの中間的な再割り当てを回避してください。

source: Use this initializer to convert from another integer type when you know the value is within the bounds of this type.
ja: このイニシャライザを使って別の整数型から変換してください、値がこの型の境界の内部であるのをあなたが知っている場合は。

source: Use this initializer to create a 64-bit integer by converting an MLDataValue with an underlying type of Int.
ja: このイニシャライザを使って64ビット整数を作成してください、MLDataValueをある基礎をなす型のIntで変換することによって

source: Use this initializer to create a new set from an existing sequence, for example, an array or a range.
ja: このイニシャライザを使って、新しい集合を既存のシーケンス、例えば、配列またはある範囲から作成してください。

source: Use this initializer to create a new set from an existing sequence, like an array or a range:
ja: このイニシャライザを使って、新しい集合を既存のシーケンス、配列またはある範囲などから作成してください：

source: Use this method only if you need the concrete range it produces.
ja: それが生成する具体的な範囲をあなたが必要とする場合にのみ、このメソッドを使ってください。

source: Use this method to avoid a nested result when your transformation produces another Result type.
ja: あなたの変換が別のResult型を生み出す時に、入れ子にされた結果を避けるためにこのメソッドを使ってください。

source: Use this method to calculate the full result of a product that would otherwise overflow.
ja: このメソッドを使うことで、そうしなければオーバーフローするであろう積の完全な結果を計算してください。

source: Use this method to calculate the quotient and remainder of a division at the same time.
ja: このメソッドを使って、除算の商と余りを同時に計算してください。

source: Use this method to generate an integer within a specific range when you are using a custom random number generator.
ja: このメソッドを使って、あなたがあつらえの無作為数生成子を使っている場合に、特定の範囲の内のある整数を作成してください。

source: Use this method to generate an integer within a specific range.
ja: このメソッドを使って、特定の範囲の内のある整数を作成してください。

source: Use this method to receive a sequence of non-optional values when your transformation produces an optional value.
ja: このメソッドを使うことで非オプショナル値のシーケンスを受け取ってください、あなたの変換がオプショナル値を生成する時に。

source: Use this method to receive a single-level collection when your transformation produces a sequence or collection for each element.
ja: あなたの変換が各要素に対してひとつのシーケンスまたはコレクションを生成する場合に、このメソッドを使って単一水準コレクションを受け取ってください。

source: Use this method to receive a single-level sequence when your transformation produces a sequence or collection for each element.
ja: あなたの変換が各要素に対してひとつのシーケンスまたはコレクションを生成する場合に、このメソッドを使って単一水準シーケンスを受け取ってください。

source: Use this method to receive an array of non-optional values when your transformation produces an optional value.
ja: このメソッドを使うことで非オプショナル値の配列を受け取ってください、あなたの変換がオプショナル値を生成する時に。

source: Use this method to receive an array of nonoptional values when your transformation produces an optional value.
ja: あなたの変換がオプショナル値を生成する場合に、このメソッドを使って非オプショナル値からなる配列を受け取ってください。

source: Use this method to remove every element in a collection that meets particular criteria.
ja: このメソッドを使って、コレクションの中の、特定の基準に合うすべての要素を除去してください。

source: Use this method to retrieve the value of this result if it represents a success, or to catch the value if it represents a failure.
ja: このメソッドを使うことで、この結果の値を回収してください、もしそれが成功を表すならば、またはそれが失敗を表すならばその値をキャッチしてください。

source: Use this method when you need random binary data to generate another value.
ja: このメソッドを、あなたが無作為バイナリデータを別の値を生成するために必要とする場合に使ってください。

source: Use this method when you need to transform the value of a Result instance when it represents a failure.
ja: このメソッドを使ってください、あなたがResultインスタンスの値をそれが失敗を表す場合に変換する必要がある時に。

source: Use this method when you need to transform the value of a Result instance when it represents a success.
ja: このメソッドを使ってください、あなたがResultインスタンスの値をそれが成功を表す場合に変換する必要がある時に。

source: Use this operator to append the elements of a sequence to the end of range-replaceable collection with same Element type.
ja: この演算子を使って、あるシーケンスに属するいくらかの要素を同じElement型を持つ範囲置換可能なコレクションの終わりに加えてください。

source: Useful mostly to recover the ability to use for…in, given just an iterator i:
ja: 主として有用なのはfor…inを使う能力を、ただイテレータiを与えるだけで獲得することです：

source: Users of your remote random number generator can decide how to handle both the success and failure cases:
ja: あなたの遠隔無作為数生成子のユーザは、成功および失敗の場合の両方をどのように取り扱うか決定できます：

source: Uses the nearest ancestor’s implementation of customMirror to create a mirror for that ancestor.
ja: 最も近い先祖のもつcustomMirrorの実装を使って、その先祖に対するミラーを作成します。

source: Using Iterators Directly
ja: イテレータを直に使う

source: Using Multiple Iterators
ja: 複数のイテレータを使う

source: Using Objective-C Runtime Features in Swift
ja: Objective-Cランタイム機能をSwiftで使用する

source: Using a Partial Range as a Sequence
ja: 部分範囲をシーケンスとして使う

source: Using a Range as a Collection of Consecutive Values
ja: 範囲を隣接値のコレクションとして使用する

source: Using a negative value as rhs is the same as performing a left shift using abs(rhs).
ja: rhsとして負の値を使うことは、abs(rhs)を使って左シフトを実行するのと同じです。

source: Using a negative value as rhs is the same as performing a right shift with abs(rhs).
ja: 負の値をrhsとして使うことは、abs(rhs)を使って右シフトを実行するのと同じです。

source: Using a negative value for rhs performs a left shift using abs(rhs).
ja: rhsに負の値を使うことは、abs(rhs)を使って左シフトを実行します。

source: Using a negative value for rhs performs a right shift using abs(rhs).
ja: rhsに負の値を使うことは、abs(rhs)を使って右シフトを実行します。

source: Using a sequence’s iterator directly gives you access to the same elements in the same order as iterating over that sequence using a for-in loop.
ja: あるシーケンスのもつイテレータを直に使うことは、あなたにfor-inループを使ってそのシーケンスに反復するのと同じ要素に同じ順序でアクセスすることを与えます。

source: Using a value for rhs that is greater than or equal to the bit width of lhs is an overshift, resulting in zero.
ja: rhsにlhsのビット幅より大きいか等しい値を使うことは、オーバーシフト、ゼロという結果になります。

source: Using a value for rhs that is greater than or equal to the bit width of lhs is an overshift.
ja: rhsにlhsのビット幅より大きいか等しい値を使うことは、オーバーシフトです。

source: Using an Option Set Type
ja: オプションセット型を使う

source: Using any other value for rhs performs a left shift on lhs by that amount.
ja: rhsに何か他の値を使うことは、左シフトをlhs上でその量だけ行います。

source: Using any other value for rhs performs a right shift on lhs by that amount.
ja: rhsに何か他の値を使うことは、右シフトをlhs上でその量だけ行います。

source: Using the forEach method is distinct from a for-in loop in two important ways:
ja: forEachメソッドを使うことは、for-inループとは２つの重要なやり方においてまったく異なります：

source: Using the prefix(through:) method is equivalent to using a partial closed range as the collection’s subscript.
ja: prefix(through:)メソッドを使うことは、部分的な完結範囲をコレクションのもつ添え字として使うことと同等です。

source: Using the prefix(upTo:) method is equivalent to using a partial half-open range as the collection’s subscript.
ja: prefix(upTo:)メソッドを使うことは、部分的な半開範囲をコレクションのもつ添え字として使うことと同等です。

source: Using the return statement in the body closure will exit only from the current call to body, not from any outer scope, and won’t skip subsequent calls.
ja: return文をbodyクロージャにおいて使うことは、ただ現在のbodyへの呼び出しから抜け出すだけです、全く外側のスコープからではなくて、そして続いて起こる呼び出しを飛ばしません。

source: Using the suffix(from:) method is equivalent to using a partial range from the index as the collection’s subscript.
ja: suffix(from:)メソッドを使うことは、インデックスからの部分的範囲をコレクションのもつ添え字として使うことと同等です。

source: Using the Nil-Coalescing Operator
ja: nil合体演算子を使う

source: Using the half-open range operator (..<) to form Range instances is preferred.
ja: 半開範囲演算子（..<）を使ってRangeインスタンスを形成することが推奨されます。

source: Using the raw value of a conforming type streamlines interoperation with Objective-C and legacy APIs and simplifies conformance to other protocols, such as Equatable, Comparable, and Hashable.
ja: 準拠する型の生の値を使うことは、Objective-CおよびレガシーAPIとの相互運用を能率的にします、そして他のプロトコル、例えばEquatable、Comparable、およびHashableなどへの準拠を簡単にします。

source: Using this approach is prone to mistakes for a few reasons, in ways that can lead to bugs and make it harder to reason about your code:
ja: この取り組みを使うことは、2、3の理由から間違いを起こす傾向があります、バグに至りうるそしてあなたのコードについて論じることをより困難にするやり方で：

source: Valid indices consist of the position of every element and a “past the end” position that’s not valid for use as a subscript argument.
ja: 有効なインデックスは、各要素の位置、および添え字引数として使うのに有効でない“終わりを過ぎた”位置から成ります。

source: Valid indices consist of the position of every element and a “past the end” position that’s not valid for use as a subscript.
ja: 有効なインデックスは、各要素の位置、および添え字として使うのに有効でない“終わりを過ぎた”位置から成ります。

source: Vend results as part of an API when you can’t return errors synchronously.
ja: 結果をAPIの一部として提供します、あなたがエラーを同期的に返すことができない場合に。

source: Visible side effects are therefore strongly discouraged within this property.
ja: 目に見える副作用は、それゆえにこのプロパティ内では強く反対されます。

source: Warning
ja: 警告

source: What’s more, when implemented using specific criteria, adoption of this protocol requires no extra work on your part.
ja: おまけに、特定の基準を使って実装される時、このプロトコルの採用はあなたの方での余分な作業を必要としません。

source: When LazyPrefixWhileSequence wraps a collection type, the performance of accessing endIndex depends on how many elements satisfy the predicate at the start of the collection, and might not offer the usual performance given by the Collection protocol.
ja: LazyPrefixWhileSequenceがコレクション型をラップする場合、endIndexにアクセスする性能はどのくらい多くの要素がこの述部をコレクションの始まりで満たすかに依存します、そしてCollectionプロトコルによって与えられる通常の性能を呈さないかもしれません。

source: When letters.reduce(into:_:) is called, the following steps occur:
ja: letters.reduce(into:_:)が呼び出される時、以下の段階が生じます：

source: When numbers.reduce(_:_:) is called, the following steps occur:
ja: numbers.reduce(_:_:)が呼び出される時、以下の段階が生じます：

source: When a partial range uses integers as its lower and upper bounds, or any other type that conforms to the Strideable protocol with an integer stride, you can use that range in a for-in loop or with any sequence method that doesn’t require that the sequence is finite.
ja: ある範囲がそれの下側および上側の境界として整数を使う、または整数歩幅を使うStrideableプロトコルに準拠する何らかの他の型を使う場合、あなたはその範囲をfor-inループにおいて、またはシーケンスが有限であることを必要としない何らかのシーケンスのメソッドで使用できます。

source: When a range uses integers as its lower and upper bounds, or any other type that conforms to the Strideable protocol with an integer stride, you can use that range in a for-in loop or with any sequence or collection method.
ja: ある範囲がそれの下側および上側の境界として整数を使う、または整数歩幅を使うStrideableプロトコルに準拠する何らかの他の型を使う場合、あなたはその範囲をfor-inループにおいて、または何らかのシーケンスまたはコレクションのメソッドで使用できます。

source: When allocating memory for multiple instances of T using an unsafe pointer, use a multiple of the type’s stride instead of its size.
ja: Tの複数のインスタンスに対して安全でないポインタを使ってメモリをアロケートする場合、それの大きさではなく、その型のもつストライドの倍数を使ってください。

source: When an existing element is inserted, the classDays set does not change.
ja: 既存の要素が挿入される時、classDays集合は変化しません。

source: When calling a function with a KeyValuePairs parameter, you can pass a Swift dictionary literal without causing a Dictionary to be created.
ja: 関数をKeyValuePairsパラメータで呼び出す場合、あなたはSwift辞書リテラルを、あるDictionaryが作成されることを生じさせないで渡すことができます。

source: When creating an option set, include a rawValue property in your type declaration.
ja: あるオプションセットを作成する場合は、rawValueプロパティをあなたの型宣言に加えてください。

source: When creating your own option set, implement this initializer with a fixed-width integer, like Int, as the RawValue type.
ja: あなた独自のオプションセットを作成する時、このイニシャライザを固定長整数、IntなどをRawValue型として使って実装してください。

source: When defining your own custom enumeration, you give it a raw type by specifying the raw type as the first item in the enumeration’s type inheritance list.
ja: あなた独自のあつらえの列挙を定義している場合、あなたはそれに生の型を与えることを、その生の型を列挙の型継承リストの最初の項目として指定することによって行います。

source: When implementing a custom type that conforms to the SetAlgebra protocol, you must implement the required initializers and methods.
ja: SetAlgebraプロトコルに準拠するあつらえの型を実装する場合、あなたは必須イニシャライザとメソッドを実装する必要があります。

source: When implementing lazy operations, wrapping elements instead of self can prevent result types from growing an extra LazySequence layer.
ja: 遅延に演算を実装するとき、elementsをselfの代わりにラップすることは、結果の型を余分のLazySequenceレイヤが増大することを防ぎます。

source: When providing new APIs that use randomness, provide a version that accepts a generator conforming to the RandomNumberGenerator protocol as well as a version that uses the default system generator.
ja: 無作為さを使う新しいAPIを提供する場合、RandomNumberGeneratorプロトコルに準拠する生成子を受け取るバージョンを、それだけでなく省略時のシステム生成子を使うバージョンも提供してください。

source: When the label component in not nil, it may represent the name of a stored property or an active enum case.
ja: labelコンポーネントがnilでない場合、それは格納プロパティの名前またはアクティブなenumケース節の名前を表すかもしれません。

source: When the additive inverse of a value is unrepresentable in a conforming type, the operation should either trap or return an exceptional value.
ja: ある値の加法の逆元が準拠する型において表現可能でない場合、演算は例外値をトラップまたは返すべきです。

source: When the app is first opened, the user is unknown, so the state of the app could be called unregistered.
ja: アプリが最初に開かれた時、ユーザは誰か分かりません、それでアプリの状態は無登録と呼ぶことができるでしょう。

source: When the bit width of T (the type of source) is equal to or greater than this type’s bit width, the result is the truncated least-significant bits of source.
ja: T（sourceの型）のビット幅がこの型のもつビット幅と等しいかより大きいならば、結果はsourceの先端を切った最下位ビットです。

source: When the bit width of T is less than this type’s bit width, the result is sign-extended to fill the remaining bits.
ja: Tのビット幅がこの型のもつビット幅より小さいならば、結果は残りのビットを満たすように符号拡張されます。

source: When the collection passed to relative(to:) starts with a different index, that index is used as the lower bound instead.
ja: relative(to:)に渡されるコレクションが異なるインデックスで始まる場合、そのインデックスは代わりに下側の境界として使われます。

source: When the publisher exhausts the elements in the sequence, the next request causes the publisher to finish.
ja: パブリッシャーがシーケンスの中の要素を使い尽くす場合、次の要請はパブリッシャーを終了させます。

source: When the return value is false, the value of i is equal to limit.
ja: 戻り値がfalseの場合、iの値はlimitに等しいです。

source: When the sequence has been exhausted, the next() method returns nil.
ja: そのシーケンスが使い尽くされたならば、next()メソッドはnilを返します。

source: When the sequence is exhausted, the accumulating value is returned to the caller.
ja: シーケンスが使い尽くされる時、蓄積値が呼び出し側へ返されます。

source: When the sequence is exhausted, the last value returned from the closure is returned to the caller.
ja: シーケンスが使い尽くされる時、クロージャから返される最後の値が呼び出し側へ返されます。

source: When the set’s Element type is neither a class nor an @objc protocol, any required bridging of elements occurs at the first access of each element, so the first operation that uses the contents of the set (for example, a membership test) can take O(n).
ja: 集合の持つElement型がクラスでも@objcプロトコルでもない場合、要素のブリッジに必要なあらゆることが要素それぞれの最初のアクセスで起こります、それで集合の内容を使う最初の演算（例えば、帰属テスト）は、O(n)をとります。

source: When using offset(of:) with a type imported from a library, don’t assume that future versions of the library will have the same behavior.
ja: offset(of:)をあるライブラリからインポートされる型で使う場合、そのライブラリの将来のバージョンが同じ挙動を持つと決めてかからないでください。

source: When working with a mirror that reflects a bidirectional or random access collection, you may find it useful to “upgrade” instances of this type to AnyBidirectionalCollection or AnyRandomAccessCollection.
ja: 双方向性のまたはランダムなアクセスのコレクションをリフレクとするミラーを扱う場合、あなたはこの型のインスタンスをAnyBidirectionalCollectionまたはAnyRandomAccessCollectionに「アップグレード」することが役立つのを発見するかもしれません。

source: When writing a function, method, or other API that might fail, you use the throws keyword on the declaration to indicate that the API call can throw an error.
ja: 失敗するかもしれない関数、メソッド、または他のAPIを書いている時、あなたはthrowsキーワードをその宣言上で使うことで、そのAPI呼び出しがエラーをスローできることを指し示します。

source: When you call methods that use random data, such as creating new random values or shuffling a collection, you can pass a RandomNumberGenerator type to be used as the source for randomness.
ja: あなたが無作為データを使うメソッドを呼び出す場合、例えば新しい無作為値を作成するまたはコレクションをシャッフルするなど、あなたはRandomNumberGenerator型を渡して、無作為さの出典として使われるようにできます。

source: When you create an index into a reversed collection using base, an index from the underlying collection, the resulting index is the position of the element before the element referenced by base.
ja: あなたが逆にされたコレクションへのインデックスを、基礎をなすコレクションからのインデックスbaseを使って作成する時、結果のインデックスはbaseによって参照される要素の前の要素の位置です。

source: When you don’t pass a generator, the default SystemRandomNumberGenerator type is used.
ja: あなたが生成子を渡さない場合、省略時のSystemRandomNumberGenerator型が使用されます。

source: When you enumerate a collection, the integer part of each pair is a counter for the enumeration, but is not necessarily the index of the paired value.
ja: あなたがあるコレクションを列挙するとき、各ペアの整数部分は列挙のためのカウンタです、しかし必ずしもペアにされた値のインデックスではありません。

source: When you have a type instead of an instance, use the MemoryLayout<T>.size static property instead.
ja: あなたがインスタンスではなくある型を持つ場合、代わりにMemoryLayout<T>.size静的プロパティを使ってください。

source: When you have a type instead of an instance, use the MemoryLayout<T>.stride static property instead.
ja: あなたがインスタンスではなくある型を持つ場合、代わりにMemoryLayout<T>.stride静的プロパティを使ってください。

source: When you import an Objective-C API into Swift, you can adopt Swift-only types such as tuples.
ja: あなたがObjective-C APIをSwiftへとインポートする場合、あなたはSwift専用の型、例えばタプルなどを採用できます。

source: When you need a range that includes the last element of a collection, use the half-open range operator (..<) with endIndex.
ja: あなたがコレクションの最後の要素を含むある範囲を必要とする時は、半開範囲演算子（..<）をendIndexとともに使ってください。

source: When you need to check whether your collection is empty, use the isEmpty property instead of checking that the count property is equal to zero.
ja: あなたのコレクションが空かどうか確認する必要がある場合、isEmptyプロパティを使ってください、countプロパティがゼロと等しいのを調べるのではなく。

source: When you need to create an instance of an option set, assign one of the type’s static members to your variable or constant.
ja: あなたがあるオプションセットのインスタンスを作成する必要がある場合は、その型のもつ静的メンバの１つをあなたの変数または定数に割り当ててください。

source: When you need to indicate that a value is missing, you use the value nil.
ja: あなたはその値が見つからないことを指し示す必要がある場合、値nilを使います。

source: When you pass a closure to an API, consider when that closure will be called relative to the other code in your app.
ja: あなたがクロージャをAPIに渡す場合、クロージャが呼び出されるのはあなたのアプリの他のコードと比較していつかを考えてください。

source: When you update your app's state, there's a single variable, state, to modify, no matter what the transition.
ja: あなたのアプリの持つ状態をあなたが更新する場合、修正するただ１つの変数、stateがあるだけです、推移が何であろうと。

source: When you use the lazy property, you give the standard library explicit permission to store the closure and the sequence in the result, and defer computation until it is needed.
ja: あなたがlazyプロパティを使う場合、あなたは標準ライブラリに明示的な権限を与えて、クロージャとシーケンスを結果に格納します、そして計算をそれが必要とされるまで延期します。

source: When you use this option, a subclass’s mirror generates default mirrors even for ancestor classes that conform to the CustomReflectable protocol.
ja: あなたがこのオプションを使う場合、下位クラスの持つミラーは省略時のミラーをCustomReflectableプロトコルに準拠する先祖クラスにさえも生成します。

source: When you want to sort a collection of elements that don’t conform to the Comparable protocol, pass a closure to this method that returns true when the first element should be ordered before the second.
ja: あなたがComparableプロトコルに準拠しない要素からなるコレクションをソートしたい場合、最初の要素が２番目の前に並べられるべき場合はtrueを返すクロージャをこのメソッドに渡してください。

source: When you want to sort a sequence of elements that don’t conform to the Comparable protocol, pass a predicate to this method that returns true when the first element should be ordered before the second.
ja: あなたがComparableプロトコルに準拠しない要素からなるシーケンスをソートしたい場合、最初の要素が２番目の前に並べられるべき時はtrueを返す述部をこのメソッドに渡してください。

source: When you're finished using a FileHandle, close it using closeFile().
ja: あなたがFileHandleの使用を完了した場合、それをcloseFile()を使って閉じてください。

source: When you’re certain that an instance of Optional contains a value, you can unconditionally unwrap the value by using the forced unwrap operator (postfix !).
ja: あなたがあるOptionalのインスタンスが値を含むことを確信している場合、あなたはその値を無条件にアンラップすることが強制アンラップ演算子（後置!）を使って行えます。
